----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1           [64, 64, 32, 32]           1,792
       BatchNorm2d-2           [64, 64, 32, 32]             128
            Conv2d-3           [64, 64, 32, 32]          36,928
       BatchNorm2d-4           [64, 64, 32, 32]             128
            Conv2d-5          [64, 128, 16, 16]          73,856
       BatchNorm2d-6          [64, 128, 16, 16]             256
            Conv2d-7          [64, 128, 16, 16]         147,584
       BatchNorm2d-8          [64, 128, 16, 16]             256
            Conv2d-9          [64, 128, 16, 16]         147,584
      BatchNorm2d-10          [64, 128, 16, 16]             256
           Conv2d-11          [64, 128, 16, 16]           1,280
           Conv2d-12          [64, 128, 16, 16]          16,512
      BatchNorm2d-13          [64, 128, 16, 16]             256
DepthwiseSeparableBlock-14          [64, 128, 16, 16]               0
           Conv2d-15            [64, 256, 8, 8]         295,168
      BatchNorm2d-16            [64, 256, 8, 8]             512
           Conv2d-17            [64, 256, 8, 8]         590,080
      BatchNorm2d-18            [64, 256, 8, 8]             512
           Conv2d-19            [64, 256, 8, 8]           2,560
           Conv2d-20            [64, 256, 8, 8]          65,792
      BatchNorm2d-21            [64, 256, 8, 8]             512
DepthwiseSeparableBlock-22            [64, 256, 8, 8]               0
AdaptiveAvgPool2d-23            [64, 256, 1, 1]               0
           Linear-24                   [64, 10]           2,570
================================================================
Total params: 1,384,522
Trainable params: 1,384,522
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.75
Forward/backward pass size (MB): 352.13
Params size (MB): 5.28
Estimated Total Size (MB): 358.16
----------------------------------------------------------------